import random


def is_valid_str(choice):
    if choice == 'да' or choice == 'нет':
        return True
    else:
        return False


answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом',
           'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да',
           'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать',
           'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет',
           'Перспективы не очень хорошие', 'Весьма сомнительно']
print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
name = input('Для более точного предсказания мне нужно знать твое имя. Представься: ')
print(f'Приветствую тебя, {name} !')
flag = True
while flag:
    questions = input('Задай свой вопрос: ')
    print("Мой ответ: ", random.choice(answers))
    while True:
        question = input('Хотите сыграть еще? (да/нет): ')
        if is_valid_str(question):
            if question == 'да':
                print()
                break
            else:
                flag = False
                break
        else:
            print('Может все-таки стоило написать "да" или "нет"? Попробуем еще раз...')
print('Возвращайся если возникнут вопросы!')
